{"modelTopology": {"model_config": {"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "inputs", "config": {"batch_input_shape": [null, 177, 98, 1], "name": "inputs", "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["inputs", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true, "batch_input_shape": [null, 177, 98, 1], "dtype": "float32", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "name": "block1_conv", "padding": "same"}}, {"inbound_nodes": [[["block1_conv", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block1_pool", "config": {"dtype": "float32", "pool_size": [3, 3], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "block1_pool", "padding": "same"}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "block1_norm", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "dtype": "float32", "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "trainable": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_norm", "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block1_norm", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true, "filters": 32, "dtype": "float32", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "name": "block2_conv", "padding": "same"}}, {"inbound_nodes": [[["block2_conv", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block2_pool", "config": {"dtype": "float32", "pool_size": [3, 3], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "block2_pool", "padding": "same"}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "block2_norm", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "dtype": "float32", "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "trainable": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_norm", "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block2_norm", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true, "filters": 32, "dtype": "float32", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "name": "block3_conv", "padding": "same"}}, {"inbound_nodes": [[["block3_conv", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block3_pool", "config": {"dtype": "float32", "pool_size": [3, 3], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "block3_pool", "padding": "same"}}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "block3_norm", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "dtype": "float32", "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "trainable": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_norm", "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block3_norm", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten", "dtype": "float32"}}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "class_name": "Dense", "name": "dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "dense", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "trainable": true, "dtype": "float32"}}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "dense_norm", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "dtype": "float32", "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "trainable": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_norm", "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_norm", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout", "config": {"dtype": "float32", "rate": 0.2, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout"}}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "Dense", "name": "pred", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "pred", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "trainable": true, "dtype": "float32"}}], "input_layers": [["inputs", 0, 0]], "name": "model_2", "output_layers": [["pred", 0, 0]]}}, "backend": "tensorflow", "training_config": {"sample_weight_mode": null, "weighted_metrics": null, "loss": "categorical_crossentropy", "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "amsgrad": false, "decay": 0.0}}, "metrics": ["acc"]}, "keras_version": "2.2.5"}, "format": "layers-model", "convertedBy": "TensorFlow.js Converter v1.3.1.1", "generatedBy": "keras v2.2.5", "weightsManifest": [{"weights": [{"name": "block1_conv/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "block1_conv/bias", "shape": [32], "dtype": "float32"}, {"name": "block1_norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "block1_norm/beta", "shape": [32], "dtype": "float32"}, {"name": "block1_norm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block1_norm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block2_conv/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "block2_conv/bias", "shape": [32], "dtype": "float32"}, {"name": "block2_norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "block2_norm/beta", "shape": [32], "dtype": "float32"}, {"name": "block2_norm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block2_norm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block3_conv/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "block3_conv/bias", "shape": [32], "dtype": "float32"}, {"name": "block3_norm/gamma", "shape": [32], "dtype": "float32"}, {"name": "block3_norm/beta", "shape": [32], "dtype": "float32"}, {"name": "block3_norm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block3_norm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "dense/kernel", "shape": [9568, 64], "dtype": "float32"}, {"name": "dense/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_norm/gamma", "shape": [64], "dtype": "float32"}, {"name": "dense_norm/beta", "shape": [64], "dtype": "float32"}, {"name": "dense_norm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "dense_norm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "pred/kernel", "shape": [64, 3], "dtype": "float32"}, {"name": "pred/bias", "shape": [3], "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}]}